In [2]:
import pandas as pd

In [74]:
chicago = pd.read_csv('chicago.csv')
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null object
dtypes: object(4)
memory usage: 1002.1+ KB

In [9]:
chicago['Department'].count()/chicago['Department'].nunique() #we can convert into categorical

916.0571428571428

In [10]:
chicago['Department'] = chicago['Department'].astype('category')

In [11]:
chicago.info() #memory reduced

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

In [16]:
'Hello World'.lower()
'Hello World'.upper()
'Hello World'.title()
len('Hello World')

11

In [18]:
#whenever we use a string function we add str
chicago['Name'].str.lower().str.upper().head()

0        AARON,  ELVIA J
1      AARON,  JEFFERY M
2         AARON,  KARINA
3    AARON,  KIMBERLEI R
4    ABAD JR,  VICENTE M
Name: Name, dtype: object

In [21]:
chicago['Name']=chicago['Name'].str.title()
chicago['Position Title'].str.len()

0        16.0
1        14.0
2        14.0
3        24.0
4        17.0
         ...
32058    14.0
32059    14.0
32060    14.0
32061    23.0
32062     NaN
Name: Position Title, Length: 32063, dtype: float64

In [22]:
'Hello World'.replace(' ','_')

'Hello_World'

In [25]:
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"Zymantas, Mark E",POLICE OFFICER,POLICE,$84450.00
32060,"Zyrkowski, Carlo E",POLICE OFFICER,POLICE,$87384.00
32061,"Zyskowski, Dariusz",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [24]:
chicago.dropna(how='all',inplace=True)

In [29]:
chicago['Department'].str.replace('MGMNT','MANAGEMENT')

0        WATER MANAGEMENT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4        WATER MANAGEMENT
               ...
32057    GENERAL SERVICES
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
Name: Department, Length: 32062, dtype: object

In [32]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$','').astype('float')

In [36]:
chicago['Employee Annual Salary'].nlargest()

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
Name: Employee Annual Salary, dtype: float64

In [39]:
mask = chicago['Department'].str.lower().str.contains('water')
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,90744.0
4,"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,106836.0
20,"Abdul-Karim, Muhammad A",ENGINEERING TECHNICIAN VI,WATER MGMNT,108228.0
25,"Abdulsattar, Mudhar",CIVIL ENGINEER II,WATER MGMNT,58536.0
34,"Abraham, Girley T",CIVIL ENGINEER IV,WATER MGMNT,106836.0
...,...,...,...,...
31983,"Zivat, Michael",CONSTRUCTION LABORER,WATER MGMNT,81536.0
31984,"Zizumbo, Daniel",POOL MOTOR TRUCK DRIVER,WATER MGMNT,72862.4
32008,"Zotta, Sandino",MECHANICAL ENGINEER IV,WATER MGMNT,106836.0
32038,"Zuno, Erik",LABORER - APPRENTICE,WATER MGMNT,73382.4
32050,"Zwarycz, Thomas J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,72862.4

In [41]:
chicago[chicago['Department'].str.lower().str.startswith('water')]
chicago[chicago['Department'].str.lower().str.endswith('water')]

Empty DataFrame
Columns: [Name, Position Title, Department, Employee Annual Salary]
Index: []

In [45]:
'    Hello'.lstrip()
'    Hello   '.lstrip()
'    Hello   '.strip()

'Hello'

In [46]:
chicago['Name'] = chicago['Name'].str.lstrip().str.rstrip()

In [3]:
chicago = pd.read_csv('chicago.csv', index_col='Name').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [4]:
chicago.index = chicago.index.str.strip().str.title()

In [5]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [51]:
chicago.columns = chicago.columns.str.upper()

In [52]:
chicago.columns

Index(['POSITION TITLE', 'DEPARTMENT', 'EMPLOYEE ANNUAL SALARY'], dtype='object')

In [53]:
'Hello Ich bin Rohit'.split(" ")

['Hello', 'Ich', 'bin', 'Rohit']

In [7]:
chicago.index.str.split(',').str.get(0).str.title().value_counts()

Williams      293
Johnson       244
Smith         241
Brown         185
Jones         183
             ...
Mulheron        1
Castellano      1
Caro            1
Zaleski         1
Kempf           1
Name: Name, Length: 13829, dtype: int64

In [8]:
chicago['Department'].str.split(' ').str.get(0).value_counts()

POLICE          12620
FIRE             4796
STREETS          2152
OEMC             1982
WATER            1840
AVIATION         1521
TRANSPORTN       1073
PUBLIC            961
GENERAL           930
FAMILY            654
FINANCE           577
HEALTH            529
CITY              490
LAW               414
BUILDINGS         262
COMMUNITY         208
BUSINESS          161
BOARD             126
DoIT              102
HUMAN              86
MAYOR'S            86
PROCUREMENT        83
IPRA               82
CULTURAL           74
ANIMAL             67
INSPECTOR          57
ADMIN              39
BUDGET             39
DISABILITIES       28
TREASURER          22
LICENSE             1
Name: Department, dtype: int64

In [10]:
chicago.index.str.split(',').str.get(1).str.strip().str.split(' ').str.get(0).value_counts()

Michael     1153
John         899
James        676
Robert       622
Joseph       537
            ...
Janaan         1
Varrick        1
Ziola          1
Veldetta       1
Para           1
Name: Name, Length: 5091, dtype: int64

In [71]:
chicago[['Last Name','First Name']] = chicago['Name'].str.split(',',expand=True)

In [72]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,Last Name,First Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [77]:
chicago[['Dept_first','Dept_last']]=chicago['Department'].str.split(' ', expand=True, n=1)

In [78]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,Dept_first,Dept_last
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,WATER,MGMNT
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,POLICE,None
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,POLICE,None
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,GENERAL,SERVICES
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,WATER,MGMNT